PSYC798W_Winter2015_syllabus.org
** Practices/attendance
\marginnote{\textbf{Required to "complete":} Seven in-class Practices}As described above, there will be one or more Practice exercises in each class. You will submit these exercises to me electronically during class, as described in class.  In order to be "complete," an individual Practice must represent a full attempt to complete the goal.  That is, you must complete some code or other activity that represents each step in the Practice, as described in the assignment.  This code does not have to actually work!  But if it does not work, you will need to add some documentation of what the problem appears to be.

Requiring Practices is the method I will use to require attendance, since these can only be submitted during class.  There is no separate grade or tracking of attendance.  There is no make-up for a Practice.  The fact that you are only required to complete 7 Practices builds in flexibility if you need to miss one or more classes for any reason. 
# If there is some constraint preventing you from being in class physically, you can arrange with me to set up a way to participate virtually (e.g., Google Hangouts), but it will still be at the same time.  You will need to arrange this with me ahead of time, and you are required to give me a reasonable justification.  
** Homework
\marginnote{\textbf{Required to "complete":} Seven out-of-class Homework}Homework will be assigned with each class.  These will be submitted to me electronically before the next class.  The method of submission will be detailed in the assignment. The assignments will represent some extension or variation on the lesson and Practice of that day.  In order to complete a Homework, you must actually complete the objective for the assignment.  

While the Homework objectives will be the same for all students, the data, and therefore the exact solutions, will be different for each student.  The first assignment is to find a good data set to use throughout the class.  The subsequent assignments will have you explore this data set and practice the things we learn in class.  The purpose of this is to allow and encourage collaboration.  Since everyone's "answers" will be slightly different, each student will need to adapt things for their particular data set.  This closely mimics a common way to learn outside of class, namely cribbing off of other people's code, and thus is designed to set you up to continue to learn on your own.

This data set is also intended to be the data used in the Final Project (described below), and thus the Homework assignments may help you biuld towards that project.

Exercises are due before the beginning of the next class period, and this will be enforced strictly. As with Practices, the requirement to correctly complete only 7 Homework assignments builds in flexibility.  But it is highly recommended to try to complete every Homework, since these will help you in your final project. 
** Final Project
The final part of the course that determines your grade is the Final Project. Here are the requirements and dates:

   - Submit a proposal: :: \marginnote{\textbf{Required to pass the course:} Submit proposal by Jan 11}You need to send me a brief written proposal (via email) for your project. This needs to outline how it will address the requirements (data, analysis, etc.). The deadline for this is *11:59 PM EST, Sunday, January 11*. If you do not send a proposal by this deadline, you will not count as "completing" the Final Project.
   - Revise proposal: :: \marginnote{\textbf{Required to "complete":} Submit revised proposal (due date determined when I send you feedback)}I will look at your proposal and either approve it or send it back to you with suggestions. If I send it back, I may require a revised proposal. I will set the deadline for this revision when I send it back to you, but it will be no later than *11:59 PM EST, Sunday, January 18*.
   - Complete the project: :: The project is a set of code completing some kind of analysis. The requirements are:
     1. Pick some data to work with
     2. Perform some kind of analysis, which may result in one or more of:
	1. Numerical results
	2. A complex object (like a regression analysis)
	3. Graphical results (like a plot)
     3. Report the analysis with appropriate documentation
     4. Some aspect of the above (data/analysis/reporting) needs to be "non-trivial," i.e., something we have not explicitly covered in class.  Examples include:
	- Data: especially messy/big/complex data
	- Analysis: simulation, non-trivial programming aspect
	- Results: tricky visualization, novel way of reporting results
	- Code: providing useful new function that would be of interest to other people
     5. Post results and replicable code via GitHub. This will be described fully in class. The requirement means that your code should compile/run/complete fully. If it does, and it does what you said in your proposal, then the project will be complete.  You will be able to verify that it works ahead of time, so there should be no uncertainty in whether the project "passes" or not. The due date\marginnote{\textbf{Required to pass the course:} Post project via GitHub by Jan 22} for the project is *11:59 PM EST, Thursday, January 22*. Projects posted after this time will not be evaluated.

A more complete set of instructions, suggestions, etc. will be made available during the first week of the course.
* Optional reading
All of the course materials will be provided by me, free. However, because R is so popular and widely used, there are many other excellent resources.  Below is a selection of "most recommended" things to look at, if you want additional information, or if you need a good reference book.

** Official R docs and manuals
  1. See here: http://cran.r-project.org/manuals.html
** Recommended general-purpose books
  1. /R in Action/ (Kabacoff): "practical" intro with some more advanced topics, including examples of some common stats analysis
  2. /R in a Nutshell/ (Adler): a good overall reference book
  3. /R Cookbook/ (Teetor): another general reference, with a lot of "recipes" for doing different things
  4. /The Art of R Programming/ (Matloff): a very readable, insightful book from a more programming perspective, good for getting a better handle on the "guts" of R
  5. /Software for Data Analysis/ (Chambers): big treatise on How R Works, from both a conceptual and technical level. Good for really deepening your understanding of programming for data analysis.
  6. /The R Inferno/ (Burns): a tongue-in-cheek look at some of the traps and pitfalls of working with R (and how to avoid them).
** More specialized stats books
  1. /Discovering Statistics with R/ (Field): nice general-purpose stats reference, written in a very light-hearted style, with tons of R examples.
  2. /An R Companion to Applied Regression/ (Fox): excellent textbook on regression, with lots of useful R code, and an accompanying package (=car=) with lots of useful functions.
  3. /Data Analysis Using Regression and Multilevel/Hierarchical Models/ (Gelman & Hill): should be required reading if you are interested in using mixed-effects models (aka multilevel/hierarchical models).
  4. /Doing Bayesian Data Analysis/ (Kruschke): very accessible intro to Bayesian analysis, with tons of R code.
  5. /Elements of Statistical Learning/ (Hastie, Tibshirani, Friedman): a seminal text on the topic, with R code from the experts.
  6. /Regression Modeling Strategies/ (Harris): a good book for digging deeper into regression models. Harris's =rms= and =Hmisc= packages are also very widely used.
