PSYC798W_Winter2015_syllabus.org
** Handy websites
  1. Quick-R: a lot of good tips and quick reference, by the author of /R in Action/ (Kabacoff).
  2. Cookbook for R: lots of handy stuff.
  3. R Task Views: a great way to find useful packages.
  4. StackOverflow: a great source for asking questions and getting answers.  Google searches on error messages often lead here.
  5. "The Google": when in doubt...
* Policies and other info
** Honor Code
You will be expected to abide by the honor code. The exercises are be designed such that comparing notes with other students is allowed and even encouraged.  However, you still need to do your own work.  For any assignment you submit, you will be held to the honor code. If you have any questions at all, please ask me before it becomes a problem.
** Copyright and licenses					   :noexport:
In this course, I will be providing you with lecture material and software. Please note that all of this is protected by copyright. We will discuss the notion of software licenses, and how this applies to code generated in this course.

You will also be creating code in this course! We will discuss your own copyright and licensing options as well.

PLEASE NOTE: we will be discussing issues of copyright and licensing, but I am not actually qualified to offer legal advice. So if you are really concerned about these issues, I encourage you to seek other advice as well.
** Accommodations
Please let me know about any requested accommodations due to disabilities as soon as possible, and we will come up with a plan.
