PSYC798W_Winter2015_syllabus.tex
\subsection*{Handy websites}
\label{sec-7-4}

\begin{enumerate}
\item Quick-R: a lot of good tips and quick reference, by the author of \emph{R in Action} (Kabacoff).
\item Cookbook for R: lots of handy stuff.
\item R Task Views: a great way to find useful packages.
\item StackOverflow: a great source for asking questions and getting answers.  Google searches on error messages often lead here.
\item ``The Google'': when in doubt\ldots{}
\end{enumerate}
\section*{Policies and other info}
\label{sec-8}
\subsection*{Honor Code}
\label{sec-8-1}

You will be expected to abide by the honor code. The exercises are be designed such that comparing notes with other students is allowed and even encouraged.  However, you still need to do your own work.  For any assignment you submit, you will be held to the honor code. If you have any questions at all, please ask me before it becomes a problem.
\subsection*{Accommodations}
\label{sec-8-2}

Please let me know about any requested accommodations due to disabilities as soon as possible, and we will come up with a plan.

\end{document}
